"USSD_ERROR" = "Lỗi khi thực hiện yêu cầu";
"USSD_TERMINATED" = "Kết thúc Phiên";

"%@ Call Forwarding\n%@\n%@%@" = "%@ Chuyển Cuộc gọi\n%@\n%@%@";
"%@ Call Waiting\n%@" = "%@ Chờ Cuộc gọi\n%@";
"%@ Call Barring\n%@\n%@" = "%@ Chặn Cuộc gọi\n%@\n%@";
"%@ Fixed Dialing\n%@" = "%@ Quay số Cố định\n%@";
"Connected Line Presentation\n%@" = "Hiển thị Đường dây Kết nối\n%@";
"Calling Line Presentation\n%@" = "Hiển thị Đường dây Gọi\n%@";
"Connected Line ID Restriction\n%@" = "Giới hạn ID Đường dây Kết nối\n%@";
"Calling Line ID Restriction\n%@" = "Giới hạn ID Đường dây Gọi\n%@";
"SIM Lock\n%@" = "Khóa SIM\n%@";
"Service Center Address\n%@" = "Địa chỉ Trung tâm Dịch vụ\n%@";
"Supplementary Service Password\n%@" = "Mật khẩu Dịch vụ Bổ sung\n%@";
"Calling Name Presentation\n%@" = "Hiển thị Tên Đang gọi\n%@";

"Forwards to %@\n" = "Chuyển tiếp tới %@\n";

"All Calls" = "Tất cả Cuộc gọi";
"All Conditional Calls" = "Tất cả Cuộc gọi Điều kiện";
"Async Data Circuit" = "Mạch Dữ liệu Không đồng bộ";
"Data" = "Dữ liệu";
"Fax" = "Fax";
"Packet Access" = "Truy cập Gói";
"Pad Access" = "Truy cập Bàn phím";
"SMS" = "SMS";
"Sync Data Circuit" = "Mạch Dữ liệu Đồng bộ";
"Voice" = "Thoại";

"All Outgoing" = "Tất cả Cuộc gọi đi";
"All Incoming" = "Tất cả Cuộc gọi đến";
"Outgoing International" = "Cuộc gọi đi Quốc tế";
"Outgoing International, Except Home Country" = "Cuộc gọi đi Quốc tế, Trừ Quốc gia Chủ nhà";
"Incoming While Roaming Outside Home Country" = "Cuộc gọi đến Trong khi Chuyển vùng ở Nước ngoài";
"Incoming, Not On SIM" = "Cuộc gọi đến, Không có Trên SIM";
"All Services" = "Tất cả Dịch vụ";
"All Outgoing Services" = "Tất cả Dịch vụ Cuộc gọi đi";
"All Incoming Services" = "Tất cả Dịch vụ Cuộc gọi đến";

"Disabled" = "Bị vô hiệu";
"Enabled" = "Đã kích hoạt";

"On All Calls" = "Trên Tất cả Cuộc gọi";
"When Busy" = "Khi Bận";
"When Unanswered" = "Khi Không có trả lời";
"When Unreachable" = "Khi Không gọi được";

"Setting %@ Succeeded" = "Cài đặt %@ Thành công\n";
"Setting Interrogation Succeeded" = "Thẩm vấn Cài đặt Thành công\n";
"Setting %@ Failed" = "Cài đặt %@ Không thành công\n";
"Setting Interrogation Failed" = "Thẩm vấn Cài đặt Không thành công\n";

"Not Available" = "Không Khả dụng";
"Network Controlled" = "Mạng bị Kiểm soát";
"Temporarily Disabled" = "Tạm thời bị Vô hiệu";
"Temporarily Enabled" = "Tạm thời được Kích hoạt";
"Unknown" = "Không xác định";

"Activation" = "Kích hoạt";
"Deactivation" = "Vô hiệu hóa";
"Interrogation" = "Thẩm vấn";
"Registration" = "Đăng ký";
"Erasure" = "Xóa";

"No Address" = "Không có Địa chỉ";
"No Service Specified" = "Không có Dịch vụ được Chỉ định";
"Type %d" = "Nhập %d";

// generic error
"CALL_FAILED" = "Không Gọi được";
// error codes
"kCTNoError" = "Không có Lỗi";
"kCTUnknownError" = "Lỗi Không xác định";
"kCTErrorRadioFailure" = "Lỗi Đài";
// Generic network errors
"kCTErrorNetworkFailure" = "Hỏng Mạng";
"kCTErrorCongestion" = "Nghẽn Mạng";
"kCTErrorUnidentifiedSubscriber" = "Thuê bao Không xác định";
"kCTErrorFacilityRejected" = "Chức năng bị Từ chối";
"kCTErrorUnknownSubscriber" = "Thuê bao Không xác định";
"kCTErrorNetworkOutOfOrder" = "Mạng không Hoạt động";
"kCTErrorInvalidTransactionIdentifier" = "Định danh Giao dịch Không hợp lệ";
"kCTErrorSemanticallyIncorrectMessage" = "Tin nhắn Không đúng về Ngữ nghĩa";
"kCTErrorInvalidMandatoryInformation" = "Thông tin Bắt buộc Không hợp lệ";
"kCTErrorMessageTypeNonExistant" = "Không tồn tại Loại Tin nhắn";
"kCTErrorMessageNotCompatibleWithProtocolState" = "Tin nhắn Không Tương thích Với Trạng thái Giao thức";
"kCTErrorInformationElementNonExistant" = "Không tồn tại Yếu tố Thông tin";
"kCTErrorProtocolErrorUnspecified" = "Lỗi Giao thức Không được chỉ định";
"kCTErrorTemporaryFailure" = "Tạm thời Không thành công";
"kCTErrorResourcesUnavailable" = "Tài nguyên Không khả dụng";
"kCTErrorRequestedFacilityNotSubscribed" = "Chưa Đăng ký Chức năng được Yêu cầu";
"kCTErrorRequestedFacilityNotImplemented" = "Chưa thực hiện Chức năng được Yêu cầu";
"kCTErrorInterworkingError" = "Lỗi Nối mạng";
"kCTErrorInterworkingNotSupported" = "Không Hỗ trợ Nối mạng";
"kCTErrorCommandCannotBeActioned" = "Không thể Thực hiện Lệnh";
"kCTErrorNoNetworkService" = "Không có Dịch vụ Mạng";
// Call related errors
"kCTErrorUnassignedNumber" = "Số Không được gán";
"kCTErrorOperatorDeterminedBarring" = "Chặn Nhà cung cấp Đã được xác định";
"kCTErrorCallBarred" = "Cuộc gọi Bị chặn";
"kCTErrorUserBusy" = "Người dùng Bận";
"kCTErrorNoUserResponding" = "Không có Người dùng Hồi đáp";
"kCTErrorNumberChanged" = "Đã thay đổi Số";
"kCTErrorInvalidNumberFormat" = "Định dạng Số Không hợp lệ";
"kCTErrorCallRejected" = "Cuộc gọi bị Từ chối";
// SIM errors
"kCTErrorSimNotInserted" = "Chưa Lắp SIM";
"kCTErrorSimPinRequired" = "Cần có PIN của SIM";
"kCTErrorSimPukRequired" = "Cần có PUK của SIM";
"kCTErrorSimFailure" = "Lỗi SIM";
"kCTErrorSimMemoryFailure" = "Lỗi Bộ nhớ SIM";
"kCTBadPinFormatError" = "Định dạng PIN Không hợp lệ";
"kCTErrorNumberNotAllowed" = "Không cho phép dùng Số";
"kCTErrorIncorrectPassword" = "Mật khẩu Không đúng";
// SMS Errors
"kCTErrorShortMessageTransferRejected" = "Chuyển Tin nhắn Ngắn bị Từ chối";
"kCTErrorDestinationOutOfOrder" = "Không Sử dụng được Nơi đến";
"kCTErrorClass0NotSupported" = "Không hỗ trợ Lớp 0";
"kCTErrorCannotReplaceSm" = "Không thể Thay SIM";
"kCTErrorUnspecifiedPid" = "PID Không xác định";
"kCTErrorDataCodingSchemeNotSupported" = "Không hỗ trợ Giao thức Mã hóa Dữ liệu";
"kCTErrorUnspecifiedDcs" = "Lỗi DCS Không xác định";
"kCTErrorCommandUnsupported" = "Lệnh Không được Hỗ trợ";
"kCTErrorUnspecifiedTpCommand" = "Lỗi Lệnh TP Không xác định";
"kCTErrorTpduNotSupported" = "Không Hỗ trợ TPDU";
"kCTErrorScBusy" = "SC Bận";
"kCTErrorRejectedBySimSmsControl" = "Bị Điều khiển SMS của SIM Từ chối";
// GPRS Errors
"kCTErrorGprsIllegalMs" = "GPRS Illegal ME";
"kCTErrorGprsIllegalMe" = "GPRS Illegal ME";
"kCTErrorGprsServicesNotAllowed" = "Không Cho phép Dịch vụ GPRS";
"kCTErrorGprsPlmnNotAllowed" = "Không Cho phép PLMN của GPRS";
"kCTErrorGprsLocationAreaNotAllowed" = "Không cho phép Khu vực Địa điểm GPRS";
"kCTErrorGprsRoamingNotAllowedInLocationArea" = "Không Cho phép Chuyển vùng GPRS Trong Khu vực Địa điểm";
"kCTErrorGprsServiceOptionNotSupported" = "Không Hỗ trợ Tùy chọn Dịch vụ GPRS";
"kCTErrorGprsServiceOptionNotSubscribed" = "Chưa đăng ký Tùy chọn Dịch vụ GPRS";
"kCTErrorGprsServiceOptionTemporarilyOutOfOrder" = "Tùy chọn Dịch vụ GPRS Tạm thời Không sử dụng được";
"kCTErrorGprsPdpAuthenticationFailure" = "Không Xác thực được PDP của GPRS";
"kCTErrorGprsInvalidMobileClass" = "Lớp Di động Không hợp lệ của GPRS";
"kCTErrorGprsUnspecified" = "GPRS Không được chỉ định";
"kCTErrorGprsMissingorUnknownAPN" = "Thiếu GPRS hoặc APN Không xác định";
"kCTErrorGprsPDPAuthenticationInfoRejectedByBaseband" = "Thông tin Xác thực PDP của GPRS bị Băng tần cơ sở Từ chối";
